Bookers220200618/app/views/users/show.html.erb

          <tbody>
	        	<% @user.books.each do |list| %>
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]