Bookers220200618/app/controllers/books_controller.rb

def index
		@books = Book.all
		@book = Book.new
		@users = User.all
		@user = User.find(current_user.id)
---
SELECT "books".* FROM "books"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def show
		@book = Book.new
		@books = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

	def create
		@book = Book.new(book_params)
		@book.user_id = current_user.id
		if @book.save
---
INSERT INTO "books" ("user_id", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["title", "asdfg"], ["body", "sdfgh"], ["created_at", "2020-06-18 12:19:42.428708"], ["updated_at", "2020-06-18 12:19:42.428708"]]

	def destroy
 		@book = Book.find(params[:id])
 		if current_user.id == @book.user_id
	 		@book.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 4]]